In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.2.4
1.20.1

In [2]:
# Persiapan data Frame 05

In [3]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10 , size =(n_rows , n_cols)),
                 columns = cols)
df

   A  B  C  D  E
0  3  3  9  6  5
1  7  3  8  5  2
2  3  2  5  7  7
3  5  8  9  4  2
4  6  9  2  9  7

In [4]:
# Membalik urutan kolom

In [5]:
df.loc[:, ::-1]

   E  D  C  B  A
0  5  6  9  3  3
1  2  5  8  3  7
2  7  7  5  2  3
3  2  4  9  8  5
4  7  9  2  9  6

In [6]:
# Membalik urutan baris

In [9]:
df.loc[::-1]

   A  B  C  D  E
4  6  9  2  9  7
3  5  8  9  4  2
2  3  2  5  7  7
1  7  3  8  5  2
0  3  3  9  6  5

In [ ]:
# Membalik urutan baris dan melakukan penyesuaian ulang index

In [11]:
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  6  9  2  9  7
1  5  8  9  4  2
2  3  2  5  7  7
3  7  3  8  5  2
4  3  3  9  6  5

In [ ]:
# Persiapan Data Frame 06

In [12]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10 , size =(n_rows , n_cols)),
                 columns = cols)
df

   A  B  C  D  E
0  7  5  4  3  2
1  5  5  5  9  1
2  8  3  6  7  4
3  2  2  7  3  4
4  5  4  7  6  4

In [13]:
# Mengganti nama (label) untuk sebuah kolom pada Data Frame

In [14]:
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  7  5     4  3  2
1  5  5     5  9  1
2  8  3     6  7  4
3  2  2     7  3  4
4  5  4     7  6  4

In [15]:
df.rename(columns={'A':'Nama', 'b':'Alamat', 'D':'Kota'}) # Mengganti nama sekaligus

   Nama  B  C  Kota  E
0     7  5  4     3  2
1     5  5  5     9  1
2     8  3  6     7  4
3     2  2  7     3  4
4     5  4  7     6  4

In [16]:
# Persiapan Data Frame Pandas 07

In [18]:
df = pd.util.testing.makeMissingDataframe().reset_index()
df.head()

        index         A         B         C         D
0  CEt4FgyZtE  0.279737 -0.115918 -1.147674  0.159879
1  VFjGm5agwH  0.786501 -0.571262 -0.162769  0.983919
2  ZhfvjyEvsS  1.030933  1.156987  1.430222       NaN
3  SOjy7Y3vpi -0.508964 -0.388515 -0.129599 -0.492470
4  BRwQhbxQn8 -0.670350 -0.578163 -0.151226  0.361742

In [38]:
df = df.rename(columns={'index':'z'})
df.head()

            z
0  CEt4FgyZtE
1  VFjGm5agwH
2  ZhfvjyEvsS
3  SOjy7Y3vpi
4  BRwQhbxQn8

In [39]:
df_backup = df.copy(deep=True)

In [ ]:
# Menghapus (drop) setiap KOLOM yang mengandung missing values

In [40]:
df = df.dropna(axis='columns')
df.head()

            z
0  CEt4FgyZtE
1  VFjGm5agwH
2  ZhfvjyEvsS
3  SOjy7Y3vpi
4  BRwQhbxQn8

In [41]:
# Menghapus (drop) setiap BARIS yang mengandung missing values

In [42]:
df = df_backup = df.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

            z
0  CEt4FgyZtE
1  VFjGm5agwH
2  ZhfvjyEvsS
3  SOjy7Y3vpi
4  BRwQhbxQn8

In [43]:
# Presentase missing values untuk setiap KOLOM

In [44]:
df = df_backup = df.copy(deep=True)
df.isna().mean()

z    0.0
dtype: float64

In [45]:
# Menghapus (drop) setiap KOLOM yang mengandung missing values berdasarkan threshold

In [47]:
treshold = len(df) * 0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head()

            z
0  CEt4FgyZtE
1  VFjGm5agwH
2  ZhfvjyEvsS
3  SOjy7Y3vpi
4  BRwQhbxQn8

In [ ]:
# Persiapan Data Frame Pandas 08

In [48]:
data = {'A':[15, 15, 18, np.nan, 12],
        'B':[15, 15, 18, np.nan, 12]}

df = pd.DataFrame(data)
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

In [49]:
df['A']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [50]:
type(df['A'])

pandas.core.series.Series

In [51]:
type(df)

pandas.core.frame.DataFrame

In [52]:
# Memeriksa kesamaan dengan operator ==

In [53]:
df['A'] == df['B']

0     True
1     True
2     True
3    False
4     True
dtype: bool

In [54]:
# Memeriksa kesamaan dengan method equals()

In [55]:
df['A'].equals(df['B'])

True

In [56]:
# Memeriksa kesamaan antar dua Data Frame

In [57]:
df1 = df.copy(deep=True)

df.equals(df1)

True

In [58]:
df == df1

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True